tap "dart-lang/dart"
tap "gcenx/wine"
tap "grishka/grishka"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "kegworks-app/kegworks"
tap "koekeishiya/formulae"
tap "localsend/localsend"
tap "nikitabobko/tap"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Object-file caching compiler wrapper
brew "ccache"
# Fast TCP/UDP tunnel over HTTP
brew "chisel-tunnel"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Automatic decryption and decoding tool
brew "ciphey"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Postgres C API library
brew "libpq", link: true
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# USB programmer
brew "dfu-util"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Network logon cracker which supports many services
brew "hydra", args: ["HEAD"]
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Modular IRC client
brew "irssi"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Text-based web browser
brew "lynx"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# General-purpose scripting language
brew "php@8.1"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@16", restart_service: :changed
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Modern Day Portscanner
brew "rustscan"
# SMB/CIFS file, print, and login server for UNIX
brew "samba"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Universal WebAssembly Runtime
brew "wasmer"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# SDK
brew "dart-lang/dart/dart"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Tools for building Android applications
cask "android-studio"
# Allows connection to a computer remotely
cask "anydesk"
# 3D creation suite
cask "blender"
# Web security testing toolkit
cask "burp-suite"
# E-books management software
cask "calibre"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Game development engine
cask "godot"
# Hex editor focussing on speed
cask "hex-fiend"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Keyboard customiser
cask "karabiner-elements"
# Porting tool, to make Windows programs/games into native apps
cask "kegworks"
# Free and open-source painting and sketching program
cask "krita"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Sandbox construction video game
cask "minecraft"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# GameStream client
cask "moonlight"
# Open-source download manager
cask "motrix"
# Collaboration platform for API development
cask "postman"
# VPN client focusing on security
cask "protonvpn"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Unpacks archive files
cask "the-unarchiver"
# Web browser focusing on security
cask "tor-browser"
# Companion app for the Trezor hardware wallet
cask "trezor-suite"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
# Mesh VPN client
cask "zerotier-one"
# Video communication and virtual meeting platform
cask "zoom"
